pmo-dataset/mermaid/39.mmd
graph LR
	classDef endEvent stroke-width:4px
	
	ParallelGateway_1{"+"} --> Service_1["List required\nmaterials"]
	ParallelGateway_1 --> Service_2["List required tools"]
	ParallelGateway_1 --> Service_3["Offer ordering\nchoices"]
	Service_1 --> ParallelGateway_2{"+"}
	Service_2 --> ParallelGateway_2
	Service_3 --> ParallelGateway_2
	User_2["Select device model"] --> User_1["Select type of\nhardware Issue"]
	User_1 --> ParallelGateway_1
	Service_4["Display repair\ninstructions"] --> Manual_1["Repair device"]
	Manual_1 --> ExclusiveGateway_1{"Is issue fixed?"}
	Manual_2["Send device to an\nexpert"] --> ExclusiveGateway_2{"X"}
	ExclusiveGateway_2 --> EndNoneEvent_1(("Hardware issue fixed")):::endEvent
	ExclusiveGateway_4{"X"} --> Service_4
	User_3["Write review"] --> ExclusiveGateway_6{"X"}
	ExclusiveGateway_6 --> ExclusiveGateway_7{"Have intention to\nupload a video of\nrepair steps?"}
	User_4["Upload video of\nreparation steps"] --> ExclusiveGateway_8{"X"}
	ExclusiveGateway_7 -->|"No"| ExclusiveGateway_8
	ExclusiveGateway_7 -->|"Yes"| User_4
	ExclusiveGateway_5{"Have intention to\nwrite a review?"} -->|"Yes"| User_3
	ExclusiveGateway_5 -->|"No"| ExclusiveGateway_6
	ExclusiveGateway_8 --> ExclusiveGateway_2
	ExclusiveGateway_10{"X"} --> User_7["Log into account"]
	User_7 --> ExclusiveGateway_11{"Is login Successful?"}
	ExclusiveGateway_11 -->|"Yes"| User_2
	ExclusiveGateway_11 -->|"No"| ExclusiveGateway_10
	ExclusiveGateway_12{"X"} --> ExclusiveGateway_10
	User_5["Get second-hand\ntools and materials\nfrom friends"] --> ExclusiveGateway_14{"X"}
	ExclusiveGateway_15{"Have intention to\npurchase new items?"} -->|"Yes"| User_6["purchase online"]
	User_6 --> ExclusiveGateway_16{"X"}
	ExclusiveGateway_13{"Have intention to\nget second-hand\nitems?"} -->|"No"| ExclusiveGateway_14
	ExclusiveGateway_15 -->|"No"| ExclusiveGateway_16
	User_8["Create account"] --> ExclusiveGateway_12
	StartNoneEvent_1(("Hardware issue\ndetected")) --> ExclusiveGateway_9{"Have an account?"}
	ExclusiveGateway_9 -->|"No"| User_8
	ExclusiveGateway_9 -->|"Yes"| ExclusiveGateway_12
	ExclusiveGateway_3{"Have all required\nitems?"} -->|"No"| ExclusiveGateway_13
	ExclusiveGateway_16 --> ExclusiveGateway_4
	ExclusiveGateway_1 -->|"No"| Manual_2
	ExclusiveGateway_1 -->|"Yes"| ExclusiveGateway_5
	ExclusiveGateway_13 -->|"Yes"| User_9["Contact friends"]
	ExclusiveGateway_3 -->|"Yes"| ExclusiveGateway_4
	User_9 --> User_5
	ExclusiveGateway_14 --> ExclusiveGateway_15
	ParallelGateway_2 --> ExclusiveGateway_3
